---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalResourceLoadData
source: html/4feea9d7-ea34-cd15-1d6f-b758eec96d09.htm
---
# ExternalResourceLoadData Properties

Indicates whether the IExternalResourceUIServer has reported errors
 for this ExternalResourceLoadData. This value can be set by the
 IExternalResourceUIServer in HandleLoadResourceResults().